input_str ="""75
95 64
17 47 82
18 35 87 10
20 04 82 47 65
19 01 23 75 03 34
88 02 77 73 07 63 67
99 65 04 28 06 16 70 92
41 41 26 56 83 40 80 70 33
41 48 72 33 47 32 37 16 94 29
53 71 44 65 25 43 91 52 97 51 14
70 11 33 28 77 73 17 78 39 68 17 57
91 71 52 38 17 14 91 43 58 50 27 29 48
63 66 04 68 89 53 67 30 73 16 69 87 40 31
04 62 98 27 23 09 70 98 73 93 38 53 60 04 23"""


li = input_str.split("\n")
for i in range(len(li)):
    li[i] = li[i].split(" ")
    for j in range(len(li[i])):
        li[i][j] = int(li[i][j])

# 最大経路の和 計算処理
# 上から順に計算
# 2つ選べるときは値が大きいほうを加算
# 3段目の例）17+95+75, 47+(95+75or64+75), 82+64+75
for i in range(1, len(li)):
    for j in range(len(li[i])):
        if(j == 0):
            li[i][j] += li[i-1][j]
        elif(j == len(li[i]) -1):
            li[i][j] += li[i-1][j-1]
        else:
            li[i][j] += max(li[i-1][j-1],li[i-1][j])

print(li)
print(max(li[len(li)-1]))